"""
Задача 1. Приветствие пользователя

Повторите действия из урока и создайте программу, которая запрашивает у пользователя имя и затем выводит для него приветствие. Для этого:

Создайте переменную и присвойте ей команду input(). Внутри скобок команды напишите приглашение, например: «Введите имя».
В следующих двух строках напишите вывод приветствия и переменной на экран.
Запустите программу, введите в консоль имя и нажмите Enter.
Убедитесь, что программа работает верно.


Задача 2. Приветствие для двух пользователей

Продолжая предыдущую программу, запросите у пользователя второе имя и выведите второе приветствие на экран.
Пример результата программы:


Задача 3. Неверная программа

Ниже приведена программа, которая должна запрашивать фамилию пользователя и выводить её на экран.
Но её написали неправильно. Скопируйте программу в редактор и исправьте все ошибки. Убедитесь, что программа работает.

sur name = inpu('Введите фамилию: ')
print('Ваша фамилия - ')
print('sur name')
"""

# Задача 1
print('Задача 1')
name = input('Как тебя зовут? ')
print('Привет!')
print(name)
# Задача 2
print('Задача 2')
name = input('Как тебя зовут? ')
print('Привет!')
print(name)
age = input('Сколько тебе лет? ')
print('Круто, тебе уже ', age, ' лет')
# Задача 3
print('Задача 3')
sur_name = input('Введите фамилию: ')
print('Ваша фамилия - ')
print(sur_name)