"""
Задача 1. Моя первая переменная
Создайте переменную, присвойте ей текст «Моя первая переменная!» и выведите значение переменной на экран. Для этого:
1. Назовите переменную, используйте только буквы латинского алфавита. Пример имени: first.
2. После этого сделайте присваивание (знак = ).
3. Вставьте нужный текст.
4. Вставьте команду вывода переменной на экран в следующей строке программы. Кавычки здесь не нужны.
5. Запустите программу и убедитесь, что в консоль выводится сообщение: «Моя первая переменная!»

Задача 2. Две переменные
Продолжая предыдущую программу, создайте ещё одну переменную с другим именем (например second),
присвойте ей значение «И не последняя!» и выведете её на экран. В результате работы программы в
консоли должно отобразиться две строки: «Моя первая переменная!» и «И не последняя!»

Задача 3. Ошибки в коде
Дана программа

my color@ = 'Зелёный'
*sport& = 'Бег'
print('Меня зовут')
print(name)
name = 'Иван'
print('Мой любимый цвет:')
print(my_color)
print('Мой любимый вид спорта:')
print(спорт)

Скопируйте программу в редактор и исправьте ошибки в названиях и выводе переменных. При необходимости переставляйте строчки местами.
Проверьте правильность работы программы.

Правильный результат:

"""

# Задача 1
print('Задача 1')
first = 'Моя первая переменная!'
print(first)
# Задача 2
print('Задача 2')
first = 'Моя первая переменная!'
second = 'И не последняя!'
print(first, second)
# Задача 3
print('Задача 3')

my_color = 'Зелёный'
sport = 'Бег'
name = 'Иван'
print('Меня зовут')
print(name)
print('Мой любимый цвет:')
print(my_color)
print('Мой любимый вид спорта:')
print(sport)
