"""
Задача 1. «Доска»
Что нужно сделать

Исправьте программу так, чтобы в результате её выполнения на экран вывелась «доска».

print('-'---------')
print('  |00000000| ')
print('''|00000000|'')
print('  |00000000| ')
print('|00000000|   ')
print('-'---------")

Вывод:

Что оценивается

Результат вывода корректен и соответствует картинке.
Отсутствуют пробелы после print и перед скобками: “print ()” — неверно, “print()” — верно.
Нет пробелов и внутри скобок.

Задача 2. Приветствие
Что нужно сделать

Напишите программу, которая выводит такое «окно» на экран. Размер окна может быть любым,
вместо слова «друг» можете написать своё имя. Постарайтесь добиться результата из третьего варианта.

Вариант 1:
Вариант 2:
Вариант 3:
"""

# Задача 1
print('----------')
print('|00000000|')
print('|00000000|')
print('|00000000|')
print('|00000000|')
print('----------')

# Задача 2

print('======================')
print('||                  ||')
print('||      Привет      ||')
print('||      Игорь!      ||')
print('||                  ||')
print('======================')