"""
Задача 3. Апгрейд калькулятора
Что нужно сделать

Степан, как и большая часть населения планеты, для расчёта суммы и разности чисел использует калькулятор.
Однако в работе ему нужно делать не только обычные действия вроде сложения и вычитания, а делать что-то
вручную он уже устал. Поэтому Степан решил немного расширить функционал своего калькулятора.
Напишите программу, запрашивающую у пользователя число и действие, которое нужно с ним сделать: вывести сумму
его цифр, максимальную или минимальную цифру. Каждое действие оформите в виде отдельной функции, а основную программу зациклите.
"""