"""
Задача 9. Сообщение
Что нужно сделать
Вашему другу надоело общаться простыми сообщениями, и он решил делать это необычным способом:
он переворачивает каждое слово в тексте, при этом не трогая знаки препинания.
Пользователь вводит текст, состоящий из слов и знаков препинания. Напишите программу, которая переворачивает
(записывает в обратном порядке) все слова текста, оставив знаки препинания без изменений.
Словом в тексте считается последовательность символов из прописных и строчных букв кириллицы.

Пример 1:
Сообщение: Это задание очень! простое.
Новое сообщение: отЭ еинадаз ьнечо! еотсорп.

Пример 2:
Сообщение: Хотя ,. возм:ожно и нет.
Новое сообщение: ятоХ ,. мзов:онжо и тен.
"""

simbol = [',', '.', '?', ':', ';', '!', '-', '...', ' ']
punctuation_marks = []
new_text = ''
start = None
# Ищем индекс символа пунктуации
text = input('Сообщение: ')
for index_simbol in range(len(text)):
    if text[index_simbol] in simbol:
        punctuation_marks.append(index_simbol)
# Добавляем в новый текст, срезанный и перевернутый текст, далее вставляем знак пунктуации
for punctuation in punctuation_marks:
    new_text += text[punctuation - 1: start: - 1]
    start = punctuation
    new_text += text[punctuation]

print('Новое сообщение: ', new_text)



