"""
Задача 3. Животные
Что нужно сделать

Создайте две переменные с именами «Первое животное» и «Второе животное» на английском языке.
Запишите в первую переменную слово «Заяц», а во вторую — «Черепаха». Используя эти переменные,
выведите на экран текст «Заяц спит, Черепаха идёт» в одну строку.
"""

animal1 = input('Введите первое животное ')
animal2 = input('Введите второе животное ')
print(animal1 + ' спит, ' + animal2 + ' идёт.')