"""
Задача 1. Яблоки

Транспортная компания ООО «ФруктыТрансСервис» занимается логистикой и грузоперевозками фруктов.
Программисту Владимиру дали задачу написать программное обеспечение, которое позволит понять,
 сколько фруктов можно загрузить и сколько останется на складе.
Напишите программу, которая решает задачу из урока: у транспортной компании есть 41 тонна яблок,
которые нужно разместить по ящикам. Каждый ящик вмещает в себя три тонны. Необходимо выяснить,
 сколько ящиков мы сможем заполнить и сколько яблок останется. Оба ответа нужно вывести на экран.

Задача 2. Последняя цифра
Избирательный участок включает в свою базу данных номера квартир и домов и, чтобы не хранить два числа отдельно,
оба номера записывает одним числом вместе, где последняя цифра — это номер дома, а всё, что перед ней, — номер квартиры.
Реализуйте программу, которая запрашивает число у пользователя, а затем выводит на экран номер дома и номер квартиры. Пример:

Задача 3. Спортсмены
Есть три спортсмена, каждый из них уже пробежал некоторое количество кругов. Каждый круг — 100 метров. Необходимо узнать,
сколько от следующего круга уже пробежал каждый спортсмен.
Напишите программу, которая получает от каждого спортсмена дистанцию, которую тот пробежал. Выведите,
сколько метров очередного круга тот уже пробежал.

Подсказка
Пусть спортсмен пробежал всего 204 метра,
Сколько целых кругов по 100 метров пробежал спортсмен?

Длина круга — 100 метров, значит, мы будем отнимать от 204 целые круги, пока дистанция больше 100 метров
204 метра
Спортсмен пробежал 1 круг, и еще 204 - 100 = 104 метра
Спортсмен пробежал 2 круга и еще 104 - 100 = 4 метра
Мы видим, что остаток меньше 100, а значит он не пробежал целый круг.
И мы можем ответить на поставленные вопросы
2 целых круга и 4 метра неполного круга.
Мы знаем, что вычитание можно заменить делением. В данном случае делением нацело.
Операция деления нацело показывает сколько целых уложится в заданном числе.
204 // 100 будет равно 2. Значит 100 целых метров укладывается 2 раза в дистанции 204 метра.
Вторая операция - это остаток от деления нацело.
Мы делим число нацело и что осталось и является результатом нашей операции.
204 % 100 будет равно 4, значит, что 4 является остатком от деления 204 на 100.
"""

# Задача 1
print('=' * 40)
print('Задача 1')
apple = 41
box_capacity = 3
print('Заполнено ящиков: ', apple // box_capacity)
print('Осталось на складе: ', apple % box_capacity)

# Задача 2
print('=' * 40)
print('Задача 2')
number = int(input('Введите число: '))
print('Номер дома: ', number % 10)
print('Номер квартиры: ', number // 10)

# Задача 3
print('=' * 40)
print('Задача 3')
distance = int(input('Введите дистанцию: '))
print('Спортсмен пробежал,', distance // 100, 'целых круга и', distance % 100, 'метров нового круга.')