"""
Задание 1

Повторите действия из урока и создайте программу, которая выводит в консоль текст Hello World!:

Зайдите в repl.it.
Создайте новый проект, язык Python.
В examples выберите пример Hello World.
Запустите программу, посмотрите, что она выводит в консоль.
Теперь измените программу, чтобы она выводила фразу ‘Привет Мир!’:

Замените Hello World! на нужный текст.
Запустите программу ещё раз, убедитесь, что всё работает.

Задание 2

Дополните программу из предыдущего задания так, чтобы она вывела в консоль приветствие,
ваше имя и любимый цвет в отдельных строчках. Затем запустите программу и проверьте результат.
Теперь попробуйте поменять местами строчки программы, например первую и третью.
В результате выведется сначала цвет, затем имя и в конце — приветствие.
"""

# Задача 1

print('Hello World!')

# Задача 2

print('Мой любимый цвет - Зеленый!')
print('Меня зовут - Игорь!')
print('Привет Мир!')
print('hello world')